Revit 2024 API
GeometryInstance.GetSymbolGeometry Method (Transform)
Computes a transformation of the geometric representation of the symbol which generates this instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public GeometryElement GetSymbolGeometry(
	Transform transform
)
Visual Basic
Public Function GetSymbolGeometry ( _
	transform As Transform _
) As GeometryElement
Visual C++
public:
GeometryElement^ GetSymbolGeometry(
	Transform^ transform
)
Parameters
transform
Type: Autodesk.Revit.DB.Transform
The transformation to apply to the geometry.
Return Value
An element which contains the computed geometry for the transformed symbol.
Remarks
The context of this instance object (such as effective material) will be applied to the symbol. Note that this method involves extensive parsing or Revit's data structures, so try to minimize calls if performance is critical. Geometry will be parsed with the same options as those used when this object was retrieved. This method returns a copy of the Revit geometry. It is suitable for use in a tool which extracts geometry to another format or carries out a geometric analysis; however, because it returns a copy the references found in the geometry objects contained in this element are not suitable for creating new Revit elements referencing the original element (for example, dimensioning). Only the geometry returned by GetSymbolGeometry() with no transform can be used for that purpose.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Transform is not conformal
See Also
GeometryInstance Class
GetSymbolGeometry Overload
Autodesk.Revit.DB Namespace